In [1]:
from pymongo import MongoClient
import pymongo
import pandas as pd
import json

In [2]:
client = MongoClient("mongodb+srv://admin:admin@cluster0.lycz6ch.mongodb.net/?retryWrites=true&w=majority")

In [3]:
db = client.get_database('Pokemash3')

In [4]:
df = pd.read_csv(r"C:\Users\tyagi\OneDrive\Desktop\Pokemash 3\Tryout\training.csv")

In [5]:
df

         Name  Power Price       Type   Seating
0    Fortuner   3200   50L        SUV         7
1         911   5000  250L     Sports         2
2      Innova   2800   30L        SUV         7
3       Swift   1200    8L  Hatchback         5
4  Maruti 800    800    2L  Hatchback         4
5     Maybach   4000  350L      Sedan         5

In [6]:
df.insert(0,'id',1)
df

   id        Name  Power Price       Type   Seating
0   1    Fortuner   3200   50L        SUV         7
1   1         911   5000  250L     Sports         2
2   1      Innova   2800   30L        SUV         7
3   1       Swift   1200    8L  Hatchback         5
4   1  Maruti 800    800    2L  Hatchback         4
5   1     Maybach   4000  350L      Sedan         5

In [7]:
df['id'] = df.index + 1
df

   id        Name  Power Price       Type   Seating
0   1    Fortuner   3200   50L        SUV         7
1   2         911   5000  250L     Sports         2
2   3      Innova   2800   30L        SUV         7
3   4       Swift   1200    8L  Hatchback         5
4   5  Maruti 800    800    2L  Hatchback         4
5   6     Maybach   4000  350L      Sedan         5

In [8]:
df.insert(len(df.columns),'rating',1400)
df

   id        Name  Power Price       Type   Seating  rating
0   1    Fortuner   3200   50L        SUV         7    1400
1   2         911   5000  250L     Sports         2    1400
2   3      Innova   2800   30L        SUV         7    1400
3   4       Swift   1200    8L  Hatchback         5    1400
4   5  Maruti 800    800    2L  Hatchback         4    1400
5   6     Maybach   4000  350L      Sedan         5    1400

In [9]:
data = df.to_dict(orient = "records")
data

[{'id': 1,
  'Name': 'Fortuner',
  'Power': 3200,
  'Price': '50L',
  'Type': 'SUV',
  ' Seating': 7,
  'rating': 1400},
 {'id': 2,
  'Name': '911',
  'Power': 5000,
  'Price': '250L',
  'Type': 'Sports',
  ' Seating': 2,
  'rating': 1400},
 {'id': 3,
  'Name': 'Innova',
  'Power': 2800,
  'Price': '30L',
  'Type': 'SUV',
  ' Seating': 7,
  'rating': 1400},
 {'id': 4,
  'Name': 'Swift',
  'Power': 1200,
  'Price': '8L',
  'Type': 'Hatchback',
  ' Seating': 5,
  'rating': 1400},
 {'id': 5,
  'Name': 'Maruti 800',
  'Power': 800,
  'Price': '2L',
  'Type': 'Hatchback',
  ' Seating': 4,
  'rating': 1400},
 {'id': 6,
  'Name': 'Maybach',
  'Power': 4000,
  'Price': '350L',
  'Type': 'Sedan',
  ' Seating': 5,
  'rating': 1400}]

In [10]:
print(db)

Database(MongoClient(host=['ac-n1i4lv1-shard-00-01.lycz6ch.mongodb.net:27017', 'ac-n1i4lv1-shard-00-02.lycz6ch.mongodb.net:27017', 'ac-n1i4lv1-shard-00-00.lycz6ch.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', authsource='admin', replicaset='atlas-i5d675-shard-0', tls=True), 'Pokemash3')

In [11]:
db.Info.insert_many(data)

In [12]:
data = db["Info"]
for x in data.find():
    print(x)

{'_id': ObjectId('6339d7259c900084d4cd2a03'), 'id': 1, 'Name\tPower\tPrice\tType\tSeating': 'Fortuner\t3200\t50L\tSUV\t7', 'rating': 1384}
{'_id': ObjectId('6339d7259c900084d4cd2a04'), 'id': 2, 'Name\tPower\tPrice\tType\tSeating': '911\t5000\t250L\tSports\t2', 'rating': 1400}
{'_id': ObjectId('6339d7259c900084d4cd2a05'), 'id': 3, 'Name\tPower\tPrice\tType\tSeating': 'Innova\t2800\t30L\tSUV\t7', 'rating': 1384}
{'_id': ObjectId('6339d7259c900084d4cd2a06'), 'id': 4, 'Name\tPower\tPrice\tType\tSeating': 'Swift\t1200\t8L\tHatchback\t5', 'rating': 1384}
{'_id': ObjectId('6339d7259c900084d4cd2a07'), 'id': 5, 'Name\tPower\tPrice\tType\tSeating': 'Maruti 800\t800\t2L\tHatchback\t4', 'rating': 1384}
{'_id': ObjectId('6339d7259c900084d4cd2a08'), 'id': 6, 'Name\tPower\tPrice\tType\tSeating': 'Maybach\t4000\t350L\tSedan\t5', 'rating': 1400}
{'_id': ObjectId('6339d778ddf841f466e02635'), 'id': 1, 'Name\tPower\tPrice\tType\tSeating': 'Fortuner\t3200\t50L\tSUV\t7', 'rating': 1400}
{'_id': ObjectId('6339d778ddf841f466e02636'), 'id': 2, 'Name\tPower\tPrice\tType\tSeating': '911\t5000\t250L\tSports\t2', 'rating': 1400}
{'_id': ObjectId('6339d778ddf841f466e02637'), 'id': 3, 'Name\tPower\tPrice\tType\tSeating': 'Innova\t2800\t30L\tSUV\t7', 'rating': 1400}
{'_id': ObjectId('6339d778ddf841f466e02638'), 'id': 4, 'Name\tPower\tPrice\tType\tSeating': 'Swift\t1200\t8L\tHatchback\t5', 'rating': 1400}
{'_id': ObjectId('6339d778ddf841f466e02639'), 'id': 5, 'Name\tPower\tPrice\tType\tSeating': 'Maruti 800\t800\t2L\tHatchback\t4', 'rating': 1400}
{'_id': ObjectId('6339d778ddf841f466e0263a'), 'id': 6, 'Name\tPower\tPrice\tType\tSeating': 'Maybach\t4000\t350L\tSedan\t5', 'rating': 1400}
{'_id': ObjectId('6339d79116181b9399c6faf4'), 'id': 1, 'Name\tPower\tPrice\tType\tSeating': 'Fortuner\t3200\t50L\tSUV\t7', 'rating': 1400}
{'_id': ObjectId('6339d79116181b9399c6faf5'), 'id': 2, 'Name\tPower\tPrice\tType\tSeating': '911\t5000\t250L\tSports\t2', 'rating': 1400}
{'_id': ObjectId('6339d79116181b9399c6faf6'), 'id': 3, 'Name\tPower\tPrice\tType\tSeating': 'Innova\t2800\t30L\tSUV\t7', 'rating': 1400}
{'_id': ObjectId('6339d79116181b9399c6faf7'), 'id': 4, 'Name\tPower\tPrice\tType\tSeating': 'Swift\t1200\t8L\tHatchback\t5', 'rating': 1400}
{'_id': ObjectId('6339d79116181b9399c6faf8'), 'id': 5, 'Name\tPower\tPrice\tType\tSeating': 'Maruti 800\t800\t2L\tHatchback\t4', 'rating': 1400}
{'_id': ObjectId('6339d79116181b9399c6faf9'), 'id': 6, 'Name\tPower\tPrice\tType\tSeating': 'Maybach\t4000\t350L\tSedan\t5', 'rating': 1400}
{'_id': ObjectId('6339d7bc73470ffba5ca0ca6'), 'id': 1, 'Name': 'Fortuner', 'Power': 3200, 'Price': '50L', 'Type': 'SUV', 'Seating': 7, 'rating': 1400}
{'_id': ObjectId('6339d7bc73470ffba5ca0ca7'), 'id': 2, 'Name': '911', 'Power': 5000, 'Price': '250L', 'Type': 'Sports', 'Seating': 2, 'rating': 1400}
{'_id': ObjectId('6339d7bc73470ffba5ca0ca8'), 'id': 3, 'Name': 'Innova', 'Power': 2800, 'Price': '30L', 'Type': 'SUV', 'Seating': 7, 'rating': 1400}
{'_id': ObjectId('6339d7bc73470ffba5ca0ca9'), 'id': 4, 'Name': 'Swift', 'Power': 1200, 'Price': '8L', 'Type': 'Hatchback', 'Seating': 5, 'rating': 1400}
{'_id': ObjectId('6339d7bc73470ffba5ca0caa'), 'id': 5, 'Name': 'Maruti 800', 'Power': 800, 'Price': '2L', 'Type': 'Hatchback', 'Seating': 4, 'rating': 1400}
{'_id': ObjectId('6339d7bc73470ffba5ca0cab'), 'id': 6, 'Name': 'Maybach', 'Power': 4000, 'Price': '350L', 'Type': 'Sedan', 'Seating': 5, 'rating': 1400}
{'_id': ObjectId('6339d8be99a2048a7cf1eccb'), 'id': 1, 'Name ': 'Fortuner', 'Power ': 3200, 'Price ': '50L', 'Type ': 'SUV', ' Seating ': 7, 'rating': 1400}
{'_id': ObjectId('6339d8be99a2048a7cf1eccc'), 'id': 2, 'Name ': '911', 'Power ': 5000, 'Price ': '250L', 'Type ': 'Sports', ' Seating ': 2, 'rating': 1400}
{'_id': ObjectId('6339d8be99a2048a7cf1eccd'), 'id': 3, 'Name ': 'Innova', 'Power ': 2800, 'Price ': '30L', 'Type ': 'SUV', ' Seating ': 7, 'rating': 1400}
{'_id': ObjectId('6339d8be99a2048a7cf1ecce'), 'id': 4, 'Name ': 'Swift', 'Power ': 1200, 'Price ': '8L', 'Type ': 'Hatchback', ' Seating ': 5, 'rating': 1400}
{'_id': ObjectId('6339d8be99a2048a7cf1eccf'), 'id': 5, 'Name ': 'Maruti 800', 'Power ': 800, 'Price ': '2L', 'Type ': 'Hatchback', ' Seating ': 4, 'rating': 1400}
{'_id': ObjectId('6339d8be99a2048a7cf1ecd0'), 'id': 6, 'Name ': 'Maybach', 'Power ': 4000, 'Price ': '350L', 'Type ': 'Sedan', ' Seating ': 5, 'rating': 1400}
{'_id': ObjectId('6339d90b6423c36cd3580d65'), 'id': 1, 'Name': 'Fortuner', 'Power': 3200, 'Price': '50L', 'Type': 'SUV', ' Seating': 7, 'rating': 1400}
{'_id': ObjectId('6339d90b6423c36cd3580d66'), 'id': 2, 'Name': '911', 'Power': 5000, 'Price': '250L', 'Type': 'Sports', ' Seating': 2, 'rating': 1400}
{'_id': ObjectId('6339d90b6423c36cd3580d67'), 'id': 3, 'Name': 'Innova', 'Power': 2800, 'Price': '30L', 'Type': 'SUV', ' Seating': 7, 'rating': 1400}
{'_id': ObjectId('6339d90b6423c36cd3580d68'), 'id': 4, 'Name': 'Swift', 'Power': 1200, 'Price': '8L', 'Type': 'Hatchback', ' Seating': 5, 'rating': 1400}
{'_id': ObjectId('6339d90b6423c36cd3580d69'), 'id': 5, 'Name': 'Maruti 800', 'Power': 800, 'Price': '2L', 'Type': 'Hatchback', ' Seating': 4, 'rating': 1400}
{'_id': ObjectId('6339d90b6423c36cd3580d6a'), 'id': 6, 'Name': 'Maybach', 'Power': 4000, 'Price': '350L', 'Type': 'Sedan', ' Seating': 5, 'rating': 1400}

In [13]:
data = db["Info"]
x = data.find_one({"id": 1},{"id":0, "_id":0})
y = data.find_one({"id": 3},{"id":0, "_id":0})

print(x)
print(y)

{'Name\tPower\tPrice\tType\tSeating': 'Fortuner\t3200\t50L\tSUV\t7', 'rating': 1384}
{'Name\tPower\tPrice\tType\tSeating': 'Innova\t2800\t30L\tSUV\t7', 'rating': 1384}

In [ ]:
def NewRating(r1, r2, n):
    exp = (r2-r1)/400.0
    e1 = 1/((10.0**(exp))+1)
    n1 = r1 + 32*(n-e1)
    return int(n1)



import random
n = df.shape[0]
for _ in range(10):
    data = db["Info"]
    idx = random.randint(1,n)
    idy = idx
    while idx == idy:
        idy = random.randint(1,n)
        
    x = data.find_one({"id": idx},{"id":0, "_id":0})
    y = data.find_one({"id": idy},{"id":0, "_id":0})
    
    print(x)
    print(y)
    winner = input("Winner(1/2) : ")
    RX = x["rating"]
    RY = y["rating"]
    
    if winner == 1:
        RX = NewRating(RX,RY,1)
        RY = NewRating(RX,RY,0)
    else:
        RX = NewRating(RY,RY,0)
        RY = NewRating(RX,RY,1)
        
    data.update_one(x,{"$set": {"rating":RX}})
    data.update_one(y,{"$set": {"rating":RY}})
    print("")

{'Name\tPower\tPrice\tType\tSeating': 'Maybach\t4000\t350L\tSedan\t5', 'rating': 1400}
{'Name\tPower\tPrice\tType\tSeating': 'Maruti 800\t800\t2L\tHatchback\t4', 'rating': 1384}

In [ ]:
data = db["Info"] 
for x in data.find({},{"id":0, "_id":0}): 
    print(x)

In [ ]:
df = pd.DataFrame(list(data.find()))
df = df.drop(df.columns[[0, 1]], axis=1)

In [ ]:
df = df.sort_values(by=['rating'], ascending=False)
df

In [ ]:
df.to_csv(r"C:\Users\tyagi\OneDrive\Desktop\Pokemash 3\Tryout\trained.csv", index=False)

In [ ]:
db.Info.drop()

In [9]:
def NewRating(r1, r2, n):
    exp = (r2-r1)/400.0
    e1 = 1/((10.0**(exp))+1)
    n1 = r1 + 32*(n-e1)
    return int(n1)

A = 2000
B = 1400
print("1:")
print(NewRating(A,B,1))
print(NewRating(B,A,0))
print("")
print("2:")
print(NewRating(A,B,0))
print(NewRating(B,A,1))

1:
2000
1399

2:
1968
1431